Repository: corcked/KreditScoreBot
Catalog: src/bot/i18n/*.po
Languages: ru, uz

source: Back
ru: Назад
uz: Orqaga

source: Cancel
ru: Отмена
uz: Bekor qilish

source: Main menu
ru: Главное меню
uz: Asosiy menyu

source: Settings
ru: Настройки
uz: Sozlamalar

source: Language
ru: Язык
uz: Til

source: Choose language
ru: Выберите язык
uz: Tilni tanlang

source: Skip
ru: Пропустить
uz: O'tkazib yuborish

source: Next
ru: Далее
uz: Keyingi

source: sum
ru: сум
uz: so'm

source: Welcome! I'm KreditScore Bot.
ru: Добро пожаловать! Я бот KreditScore.
uz: Xush kelibsiz! Men KreditScore botiman.

source: I'll help you:
ru: Я помогу вам:
uz: Men sizga yordam beraman:

source: Calculate debt burden indicator
ru: Рассчитать показатель долговой нагрузки
uz: Qarz yuki ko'rsatkichini hisoblash

source: Get credit score
ru: Получить кредитный скоринг
uz: Kredit skoringni olish

source: Apply for a loan
ru: Подать заявку на кредит
uz: Kredit uchun ariza berish

source: Share your phone number to continue
ru: Поделитесь номером телефона для продолжения
uz: Davom etish uchun telefon raqamingizni ulashing

source: Share phone number
ru: Поделиться номером
uz: Telefon raqamini ulashish

source: New application
ru: Новая заявка
uz: Yangi ariza

source: My applications
ru: Мои заявки
uz: Mening arizalarim

source: My indicators
ru: Мои показатели
uz: Mening ko'rsatkichlarim

source: Personal data
ru: Личные данные
uz: Shaxsiy ma'lumotlar

source: Referral program
ru: Реферальная программа
uz: Referal dasturi

source: Choose loan type
ru: Выберите тип кредита
uz: Kredit turini tanlang

source: Car loan
ru: Автокредит
uz: Avtokredit

source: Microloan
ru: Микрозайм
uz: Mikroqarz

source: Up to
ru: До
uz: gacha

source: Rate
ru: Ставка
uz: Stavka

source: Term
ru: Срок
uz: Muddat

source: months
ru: мес
uz: oy

source: years
ru: лет
uz: yil

source: Choose car condition
ru: Выберите состояние автомобиля
uz: Avtomobil holatini tanlang

source: New
ru: Новый
uz: Yangi

source: Used
ru: Подержанный
uz: Ishlatilgan

source: Choose receive method
ru: Выберите способ получения денег
uz: Pul olish usulini tanlang

source: To card
ru: На карту
uz: Kartaga

source: Cash
ru: Наличными
uz: Naqd pul

source: Enter loan amount
ru: Введите сумму кредита
uz: Kredit summasini kiriting

source: Enter interest rate
ru: Введите процентную ставку
uz: Foiz stavkasini kiriting

source: Enter loan term in months
ru: Введите срок кредита в месяцах
uz: Kredit muddatini oylarda kiriting

source: Enter your monthly income
ru: Введите ваш ежемесячный доход
uz: Oylik daromadingizni kiriting

source: Do you have monthly payments for other loans?
ru: Есть ли у вас ежемесячные платежи по другим кредитам?
uz: Boshqa kreditlar bo'yicha oylik to'lovlaringiz bormi?

source: If yes, enter total amount. If no, click 'Skip'.
ru: Если да, введите общую сумму. Если нет, нажмите 'Пропустить'.
uz: Agar ha bo'lsa, umumiy summani kiriting. Yo'q bo'lsa, 'O'tkazib yuborish' tugmasini bosing.

source: Check application data
ru: Проверьте данные заявки
uz: Ariza ma'lumotlarini tekshiring

source: Amount
ru: Сумма
uz: Summa

source: Monthly payment
ru: Ежемесячный платеж
uz: Oylik to'lov

source: Income
ru: Доход
uz: Daromad

source: Other payments
ru: Другие платежи
uz: Boshqa to'lovlar

source: All correct?
ru: Все верно?
uz: Hammasi to'g'rimi?

source: Confirm
ru: Подтвердить
uz: Tasdiqlash

source: Application created successfully!
ru: Заявка успешно создана!
uz: Ariza muvaffaqiyatli yaratildi!

source: What's next?
ru: Что дальше?
uz: Keyingi qadam?

source: Send to bank
ru: Отправить в банк
uz: Bankka yuborish

source: Your current application
ru: Ваша текущая заявка
uz: Sizning joriy arizangiz

source: Date
ru: Дата
uz: Sana

source: Status
ru: Статус
uz: Holat

source: Sent to bank
ru: Отправлена в банк
uz: Bankka yuborildi

source: Archived
ru: В архиве
uz: Arxivda

source: You have no active applications.
ru: У вас нет активных заявок.
uz: Sizda faol arizalar yo'q.

source: Create new application to calculate debt burden.
ru: Создайте новую заявку для расчета долговой нагрузки.
uz: Qarz yukini hisoblash uchun yangi ariza yarating.

source: Your financial indicators
ru: Ваши финансовые показатели
uz: Sizning moliyaviy ko'rsatkichlaringiz

source: Debt burden indicator (DTI)
ru: Показатель долговой нагрузки (ПДН)
uz: Qarz yuki ko'rsatkichi (QYK)

source: DTI
ru: ПДН
uz: QYK

source: Excellent indicator!
ru: Отличный показатель!
uz: A'lo ko'rsatkich!

source: Acceptable indicator
ru: Приемлемый показатель
uz: Qoniqarli ko'rsatkich

source: High debt burden
ru: Высокая долговая нагрузка
uz: Yuqori qarz yuki

source: Calculation details
ru: Детали расчета
uz: Hisoblash tafsilotlari

source: Banks may approve the loan
ru: Банки могут одобрить кредит
uz: Banklar kreditni tasdiqlashi mumkin

source: Banks do not issue loans with DTI > 50%
ru: При ПДН > 50% банки не выдают кредиты
uz: QYK > 50% bo'lsa banklar kredit bermaydi

source: You have no active applications
ru: У вас нет активных заявок
uz: Sizda faol arizalar yo'q

source: Create application to calculate DTI
ru: Создайте заявку для расчета ПДН
uz: QYKni hisoblash uchun ariza yarating

source: Credit scoring
ru: Кредитный скоринг
uz: Kredit skoring

source: Your score
ru: Ваш балл
uz: Sizning balingiz

source: Profile completion
ru: Профиль заполнен на
uz: Profil to'ldirilgan

source: Fill in all data to increase score
ru: Заполните все данные для увеличения балла
uz: Balni oshirish uchun barcha ma'lumotlarni to'ldiring

source: Scoring not calculated
ru: Скоринг не рассчитан
uz: Skoring hisoblanmagan

source: Fill personal data for calculation
ru: Заполните персональные данные для расчета
uz: Hisoblash uchun shaxsiy ma'lumotlarni to'ldiring

source: Create application
ru: Создать заявку
uz: Ariza yaratish

source: Fill data
ru: Заполнить данные
uz: Ma'lumotlarni to'ldirish

source: Complete data
ru: Дополнить данные
uz: Ma'lumotlarni to'ldirish

source: Fill personal data
ru: Заполнить личные данные
uz: Shaxsiy ma'lumotlarni to'ldirish

source: Enter your age
ru: Введите ваш возраст
uz: Yoshingizni kiriting

source: Age
ru: Возраст
uz: Yosh

source: Choose your gender
ru: Выберите ваш пол
uz: Jinsingizni tanlang

source: Gender
ru: Пол
uz: Jins

source: Male
ru: Мужской
uz: Erkak

source: Female
ru: Женский
uz: Ayol

source: Choose marital status
ru: Выберите семейное положение
uz: Oilaviy holatni tanlang

source: Marital status
ru: Семейное положение
uz: Oilaviy holat

source: Single
ru: Холост/Не замужем
uz: Turmush qurmagan

source: Married
ru: Женат/Замужем
uz: Turmush qurgan

source: Divorced
ru: Разведен(а)
uz: Ajrashgan

source: Widowed
ru: Вдовец/Вдова
uz: Beva

source: Choose education level
ru: Выберите уровень образования
uz: Ta'lim darajasini tanlang

source: Education
ru: Образование
uz: Ta'lim

source: Secondary
ru: Среднее
uz: O'rta

source: Vocational
ru: Среднее специальное
uz: O'rta maxsus

source: Incomplete higher
ru: Неполное высшее
uz: Tugallanmagan oliy

source: Higher
ru: Высшее
uz: Oliy

source: Postgraduate
ru: Послевузовское
uz: Oliy ta'limdan keyingi

source: Choose housing status
ru: Выберите статус жилья
uz: Uy-joy holatini tanlang

source: Housing status
ru: Статус жилья
uz: Uy-joy holati

source: Own
ru: Собственное
uz: Shaxsiy

source: Own with mortgage
ru: Собственное (ипотека)
uz: Shaxsiy (ipoteka)

source: Rent
ru: Аренда
uz: Ijara

source: With relatives
ru: У родственников
uz: Qarindoshlar bilan

source: Choose your region
ru: Выберите ваш регион
uz: Viloyatingizni tanlang

source: Region
ru: Регион
uz: Viloyat

source: Tashkent
ru: Ташкент
uz: Toshkent

source: Tashkent region
ru: Ташкентская область
uz: Toshkent viloyati

source: Enter work experience in months
ru: Введите стаж работы в месяцах
uz: Ish stajini oylarda kiriting

source: Work experience (months)
ru: Стаж работы (месяцев)
uz: Ish staji (oy)

source: Enter years at current address
ru: Введите количество лет по текущему адресу
uz: Joriy manzilda necha yil yashayotganingizni kiriting

source: Years at current address
ru: Лет по текущему адресу
uz: Joriy manzilda (yil)

source: Do you have other loans?
ru: Есть ли у вас другие кредиты?
uz: Boshqa kreditlaringiz bormi?

source: Yes
ru: Да
uz: Ha

source: No
ru: Нет
uz: Yo'q

source: Enter monthly payment for other loans
ru: Введите ежемесячный платеж по другим кредитам
uz: Boshqa kreditlar bo'yicha oylik to'lovni kiriting

source: Enter number of closed loans
ru: Введите количество закрытых кредитов
uz: Yopilgan kreditlar sonini kiriting

source: Number of closed loans
ru: Количество закрытых кредитов
uz: Yopilgan kreditlar soni

source: Personal data saved!
ru: Личные данные сохранены!
uz: Shaxsiy ma'lumotlar saqlandi!

source: Your personal data
ru: Ваши личные данные
uz: Sizning shaxsiy ma'lumotlaringiz

source: years old
ru: лет
uz: yosh

source: Not filled
ru: Не заполнено
uz: To'ldirilmagan

source: Edit
ru: Изменить
uz: O'zgartirish

source: Referral Program
ru: Реферальная программа
uz: Referal dasturi

source: Your referral code
ru: Ваш реферальный код
uz: Sizning referal kodingiz

source: Referral link
ru: Реферальная ссылка
uz: Referal havola

source: Invited users
ru: Приглашенных пользователей
uz: Taklif qilingan foydalanuvchilar

source: people
ru: человек
uz: kishi

source: Share
ru: Поделиться
uz: Ulashish

source: Invite friends and get bonuses!
ru: Приглашайте друзей и получайте бонусы!
uz: Do'stlaringizni taklif qiling va bonuslar oling!

source: Your friend registered via your link!
ru: Ваш друг зарегистрировался по вашей ссылке!
uz: Do'stingiz sizning havolangiz orqali ro'yxatdan o'tdi!

source: To send application to bank, fill personal data
ru: Для отправки заявки в банк заполните личные данные
uz: Arizani bankka yuborish uchun shaxsiy ma'lumotlarni to'ldiring

source: Send application to bank?
ru: Отправить заявку в банк?
uz: Arizani bankka yuborasizmi?

source: Application sent to bank!
ru: Заявка отправлена в банк!
uz: Ariza bankka yuborildi!

source: You'll be notified about bank's decision
ru: Мы уведомим вас о решении банка
uz: Bank qarori haqida sizga xabar beramiz

source: Incorrect phone number. Try again.
ru: Некорректный номер телефона. Попробуйте еще раз.
uz: Noto'g'ri telefon raqami. Qayta urinib ko'ring.

source: You are not registered. Use /start to begin.
ru: Вы еще не зарегистрированы. Используйте /start для начала.
uz: Siz ro'yxatdan o'tmagansiz. Boshlash uchun /start dan foydalaning.

source: Error: user not found
ru: Ошибка: пользователь не найден
uz: Xato: foydalanuvchi topilmadi

source: Enter correct amount (numbers only)
ru: Введите корректную сумму (только цифры)
uz: To'g'ri summani kiriting (faqat raqamlar)

source: Amount must be positive
ru: Сумма должна быть положительной
uz: Summa musbat bo'lishi kerak

source: Maximum amount
ru: Максимальная сумма
uz: Maksimal summa

source: Rate must be between
ru: Ставка должна быть от
uz: Stavka quyidagilar orasida bo'lishi kerak

source: and
ru: до
uz: va

source: Enter correct interest rate
ru: Введите корректную процентную ставку
uz: To'g'ri foiz stavkasini kiriting

source: Term must be from
ru: Срок должен быть от
uz: Muddat quyidagilar orasida bo'lishi kerak

source: to
ru: до
uz: gacha

source: Enter number of months (numbers only)
ru: Введите количество месяцев (только цифры)
uz: Oylar sonini kiriting (faqat raqamlar)

source: You must be over 18 years old
ru: Вы должны быть старше 18 лет
uz: Siz 18 yoshdan katta bo'lishingiz kerak

source: Enter correct age
ru: Введите корректный возраст
uz: To'g'ri yoshni kiriting

source: Enter age (numbers only)
ru: Введите возраст (только цифры)
uz: Yoshni kiriting (faqat raqamlar)

source: cannot be negative
ru: не может быть отрицательным
uz: manfiy bo'lishi mumkin emas

source: Enter
ru: Введите
uz: Kiriting

source: (numbers only)
ru: (только цифры)
uz: (faqat raqamlar)

source: Action cancelled
ru: Действие отменено
uz: Amal bekor qilindi

source: Application creation cancelled
ru: Создание заявки отменено
uz: Ariza yaratish bekor qilindi

source: Language changed successfully
ru: Язык успешно изменен
uz: Til muvaffaqiyatli o'zgartirildi

source: Current language
ru: Текущий язык
uz: Joriy til

source: Russian
ru: Русский
uz: Rus tili

source: Uzbek
ru: Узбекский
uz: O'zbek tili

source: Attention! With DTI > 50% banks won't issue a loan.
ru: Внимание! При ПДН > 50% банки не смогут выдать кредит.
uz: Diqqat! QYK > 50% bo'lsa banklar kredit bermaydi.

source: Available commands
ru: Доступные команды
uz: Mavjud buyruqlar

source: Start bot
ru: Начать работу с ботом
uz: Botni boshlash

source: My application
ru: Моя заявка
uz: Mening arizam

source: Help
ru: Помощь
uz: Yordam

source: billion
ru: млрд
uz: mlrd

source: million
ru: млн
uz: mln

source: Excellent indicator! Banks will readily approve the loan.
ru: Отличный показатель! Банки охотно одобрят кредит.
uz: A'lo ko'rsatkich! Banklar kreditni bemalol tasdiqlaydi.

source: Acceptable indicator. Loan approval is possible.
ru: Приемлемый показатель. Возможно одобрение кредита.
uz: Qoniqarli ko'rsatkich. Kreditni tasdiqlash mumkin.

source: High debt burden! Banks won't be able to issue a loan.
ru: Высокая долговая нагрузка! Банки не смогут выдать кредит.
uz: Yuqori qarz yuki! Banklar kredit bera olmaydi.

source: Error: data not found
ru: Ошибка: данные не найдены
uz: Xato: ma'lumotlar topilmadi

source: Bot Usage Guide
ru: Справка по использованию бота
uz: Botdan foydalanish bo'yicha qo'llanma

source: Main commands
ru: Основные команды
uz: Asosiy buyruqlar

source: Start using the bot
ru: Начать работу с ботом
uz: Bot bilan ishlashni boshlash

source: My current application
ru: Моя текущая заявка
uz: Mening joriy arizalarim

source: This help
ru: Эта справка
uz: Ushbu yordam

source: How to use the bot
ru: Как пользоваться ботом
uz: Botdan qanday foydalanish

source: Creating an application
ru: Создание заявки
uz: Ariza yaratish

source: Choose loan type (car loan or microloan)
ru: Выберите тип кредита (автокредит или микрозайм)
uz: Kredit turini tanlang (avtokredit yoki mikroqarz)

source: Specify amount, rate and term
ru: Укажите сумму, ставку и срок
uz: Summa, stavka va muddatni ko'rsating

source: Enter your income
ru: Введите ваш доход
uz: Daromadingizni kiriting

source: DTI calculation
ru: Расчет ПДН
uz: PDN hisobi

source: DTI is calculated automatically
ru: ПДН рассчитывается автоматически
uz: PDN avtomatik hisoblanadi

source: excellent indicator
ru: отличный показатель
uz: a'lo ko'rsatkich

source: acceptable indicator
ru: приемлемый показатель
uz: qoniqarli ko'rsatkich

source: high load
ru: высокая нагрузка
uz: yuqori yuk

source: Credit score
ru: Скоринг-балл
uz: Skoring balli

source: Fill in personal data
ru: Заполните персональные данные
uz: Shaxsiy ma'lumotlarni to'ldiring

source: The more data, the higher the score
ru: Чем больше данных, тем выше балл
uz: Ma'lumotlar qancha ko'p bo'lsa, ball shuncha yuqori

source: Invite friends for bonuses
ru: Приглашайте друзей для бонусов
uz: Bonuslar uchun do'stlarni taklif qiling

source: Sending to bank
ru: Отправка в банк
uz: Bankka yuborish

source: Available when DTI ≤ 50%
ru: Доступна при ПДН ≤ 50%
uz: PDN ≤ 50% bo'lganda mavjud

source: Application is sent to all partner banks
ru: Заявка отправляется во все банки-партнеры
uz: Ariza barcha hamkor banklarga yuboriladi

source: Response will come within 10 minutes
ru: Ответ придет в течение 10 минут
uz: Javob 10 daqiqa ichida keladi

source: Have questions?
ru: Есть вопросы?
uz: Savollaringiz bormi?

source: Contact support
ru: Обратитесь в поддержку
uz: Qo'llab-quvvatlash xizmatiga murojaat qiling

source: Work experience
ru: Стаж работы
uz: Ish tajribasi

source: How many years have you lived at your current address?
ru: Сколько лет вы проживаете по текущему адресу?
uz: Hozirgi manzilingizda necha yil yashagansiz?

source: Number of years
ru: Количество лет
uz: Yillar soni

source: Specify your housing status:
ru: Укажите ваш статус жилья:
uz: Uy-joy holatingizni ko'rsating:

source: Specify your marital status:
ru: Укажите ваше семейное положение:
uz: Oilaviy ahvolingizni ko'rsating:

source: Specify your education level:
ru: Укажите ваш уровень образования:
uz: Ta'lim darajangizni ko'rsating:

source: How many loans have you successfully closed?
ru: Сколько кредитов вы успешно закрыли?
uz: Nechta kreditni muvaffaqiyatli yopdingiz?

source: (enter 0 if you had no loans)
ru: (введите 0, если не было кредитов)
uz: (kreditlar bo'lmasa 0 kiriting)

source: Number of loans
ru: Количество кредитов
uz: Kreditlar soni

source: Which region do you live in?
ru: В каком регионе вы проживаете?
uz: Qaysi viloyatda yashaysiz?

source: Data saved successfully!
ru: Данные успешно сохранены!
uz: Ma'lumotlar muvaffaqiyatli saqlandi!

source: Data saved!
ru: Данные сохранены!
uz: Ma'lumotlar saqlandi!

source: Payment amount
ru: Сумма платежа
uz: To'lov summasi

source: Andijan
ru: Андижан
uz: Andijon

source: Bukhara
ru: Бухара
uz: Buxoro

source: Fergana
ru: Фергана
uz: Farg'ona

source: Jizzakh
ru: Джизак
uz: Jizzax

source: Namangan
ru: Наманган

source: Navoiy
ru: Навои

source: Qashqadaryo
ru: Кашкадарья

source: Samarkand
ru: Самарканд
uz: Samarqand

source: Sirdaryo
ru: Сырдарья

source: Surxondaryo
ru: Сурхандарья

source: Xorazm
ru: Хорезм

source: Karakalpakstan
ru: Каракалпакстан
uz: Qoraqalpog'iston

source: Invalid calculation parameters
ru: Некорректные параметры для расчета
uz: Noto'g'ri hisoblash parametrlari

source: Income must be positive
ru: Доход должен быть положительным
uz: Daromad musbat bo'lishi kerak

source: Loan amount must be positive
ru: Сумма кредита должна быть положительной
uz: Kredit summasi musbat bo'lishi kerak

source: Amount exceeds maximum for {loan_type}: {max_amount} sum
ru: Сумма превышает максимальную для {loan_type}: {max_amount} сум
uz: {loan_type} uchun maksimal summadan oshadi: {max_amount} so'm

source: Rate must be between {min_rate}% and {max_rate}%
ru: Ставка должна быть от {min_rate}% до {max_rate}%
uz: Stavka {min_rate}% dan {max_rate}% gacha bo'lishi kerak

source: Term must be from {min_term} to {max_term} months
ru: Срок должен быть от {min_term} до {max_term} месяцев
uz: Muddat {min_term} dan {max_term} oygacha bo'lishi kerak

source: Cannot use your own referral link
ru: Нельзя использовать собственную реферальную ссылку
uz: O'z referral havolangizdan foydalana olmaysiz

source: Age ≥ 35 years
ru: Возраст ≥ 35 лет
uz: Yosh ≥ 35 yil

source: Female gender
ru: Женский пол
uz: Ayol jinsi

source: Work experience ≥ 24 months
ru: Стаж работы ≥ 24 месяцев
uz: Ish tajribasi ≥ 24 oy

source: Living at address ≥ 3 years
ru: Проживание по адресу ≥ 3 лет
uz: Manzilda yashash ≥ 3 yil

source: Own home without mortgage
ru: Собственное жилье без ипотеки
uz: Ipotekasiz shaxsiy uy

source: Higher education
ru: Высшее образование
uz: Oliy ma'lumot

source: Closed loans ≥ 3
ru: Закрытых займов ≥ 3
uz: Yopilgan kreditlar ≥ 3

source: Has other loans but DTI ≤ 50%
ru: Есть другие кредиты, но ПДН ≤ 50%
uz: Boshqa kreditlar bor, lekin PDN ≤ 50%

source: Tashkent or Tashkent region
ru: Ташкент или Ташкентская область
uz: Toshkent yoki Toshkent viloyati

source: Apple device
ru: Устройство Apple
uz: Apple qurilmasi

source: Referrals ({count} people)
ru: Рефералы ({count} чел.)
uz: Referallar ({count} kishi)

source: Excellent
ru: Отличный
uz: A'lo

source: Good
ru: Хороший
uz: Yaxshi

source: Average
ru: Средний
uz: O'rtacha

source: Below average
ru: Ниже среднего
uz: O'rtachadan past

source: Low
ru: Низкий
uz: Past

source: Your credit score: {score}
ru: Ваш скоринг-балл: {score}
uz: Sizning skoring ballingiz: {score}

source: Level: {level}
ru: Уровень: {level}
uz: Daraja: {level}

source: Breakdown:
ru: Детализация:
uz: Tafsilotlar:

source: Address stability
ru: Стабильность адреса
uz: Manzil barqarorligi

source: Region of residence
ru: Регион проживания
uz: Yashash viloyati

source: Monthly income
ru: Ежемесячный доход
uz: Oylik daromad

source: Other loans available
ru: Наличие других кредитов
uz: Boshqa kreditlar mavjudligi

source: Other loan payments
ru: Платежи по другим кредитам
uz: Boshqa kreditlar bo'yicha to'lovlar

source: commands
uz: buyruqlar

source: messages
uz: xabarlar

source: Rate limit exceeded for {limit_type} per minute. Please wait a moment before the next request.
uz: Bir daqiqada {limit_type} limiti oshib ketdi. Iltimos, keyingi so'rovdan oldin biroz kuting.

source: This field is protected because it's already filled and affects your credit score. This ensures the reliability of your assessment.
uz: Bu maydon himoyalangan, chunki u allaqachon to'ldirilgan va sizning kredit reytingingizga ta'sir qiladi. Bu sizning baholashingizning ishonchliligini ta'minlaydi.

source: This field is protected.
uz: Bu maydon himoyalangan.
